Revit 2024 API
BuiltInFailures.FabricSheetFailures.FabricSheetOutSideOfHostWarning Property
 Fabric Sheet is placed completely outside of its host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FabricSheetOutSideOfHostWarning { get; }
Visual Basic
Public Shared ReadOnly Property FabricSheetOutSideOfHostWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FabricSheetOutSideOfHostWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FabricSheetFailures Class
Autodesk.Revit.DB Namespace